#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//表达式求值
//优先级（+-*/的顺序）和结合性（N/A--无结合性，L-R--左->右,R-L->右->左）

//1、隐式类型转换---大小 小于int的(整形提升：char(以ASCII码值存储)和shot-->int在cpu内(ALU)运算)
//整型提升：按变量的数据类型的符号位来提升
//char c1=-1;
//11111111		(最多只能放2**8，多余就会截断)
//-->11111111111111111111111111111111 -> -1的补码
//char c2=1;
//00000001
//-->00000000000000000000000000000001 -> 1的补码
//若提升无符号位，补0;
//int main()
//{
//	//char a = 5;//00000000000000000000000000000101
//	//char b = 126;//00000000000000000000000001111110
//	//char c = a + b;//11111111111111111111111110000011-->11111111111111111111111110000010->10000000000000000000000001111101
//
//	//printf("%d\n", c);
//
//	char c = 1;
//	printf("%u\n", sizeof(c));   //1
//	printf("%u\n", sizeof((+c)));//4,虽然"+"屁用没有，但ta是表达式，存在整形提升
//	printf("%u\n", sizeof((-c)));//4,"-"同理
//	
//	return 0;
//}
//char:-128~127		ASCII:0~127

//2、算数转换---大小 大于等于int的(向上转换：long double<--double<--foult<--unsigned long int<--long int<--unsigned int<--int)
//1、操作符的优先级(相邻操作符：3+2*4+9)
//2、操作符的结合性(优先级相同，考虑结合性：3+8+9)
//3、是否控制求值顺序(&&	||	?:	,)


//问题表达式

int main()
{
	////1、问题表达式
	//int a, b, c, d, e, f , g = 0;
	//g = a * b + c * d + e * f;
	//1    3   2   5   4
	//1    4   2   5   3
	//计算路径不唯一，有时影响结果(加括号，或者写简洁点)

	////2、问题表达式
	//c + --c;//2c-1	2c-2 ?
	
	////3、问题表达式
	//int i = 10;
	//i = i-- - --i * (i = -3) * i++ + ++i;
	//printf("%d\n", i);

	////4、问题表达式
	//int a = 1;
	//int b = (++a) + (++a) + (++a);//12(C)  10(linux)...   计算路径不唯一
	//printf("%d\n",b);
	//printf("%d\n", a);

	return 0;
}

