
#include<stdio.h>



//一维数组   数组：一组相同元素的集合

//int main()
//{
//////数组的创建		type_t arr_name [const_n];
//////type_t--->数组元素类型		const_n---->常量表达式，指定数组大小
////	int arr[10];
////	char ch[5+1];
////
////	//下面代码，只能在支持C99标准上的编译器(linux,gcc,)上运行
////	int n = 10;
////	scanf("%d",&n);
////	double data1[n];//这种数组不能初始化
////	//C99标准前，数组的大小必须是常量/常量表达式
////	//C99后，数组大小可以是变量，为了支持变长数组
//
//
//
//	////数组的初始化
//	// 
//	////不完全初始化，剩余元素默认初始化为0
//	//int arr[10] = {1,2,3,4,5};
//	//char ch1[10] = { 'q','d' };//仅有qd
//	//char ch2[10] = { 'qd' };//qd+"\0"
//	//char ch2[]={ 'qd' };
//	//char ch3[] = "qd";
//	////完全初始化
//	//int arr1[2] = { 1,2 };
//	return 0;
//}



//int main()
//{
//	//一维数组的使用
//	//int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	//[]--->下标引用操作符
//	/*int arr[] = { 1,2,3,4,5,6,7,8,9,0 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = sz - 1;i >= 0;i--)
//		printf("%d ",arr[i]);*/
//
//
//
//	////一维数组在内存中的存储
//	//int arr[] = { 1,2,3,4,5,6,7,8,9,0 };
//	//int i = 0;
//	//int sz = sizeof(arr) / sizeof(arr[0]);
//	//for (i = sz - 1;i >= 0;i--)
//	//	printf("arr[%d]=%p\n",i,&arr[i]);//一维数组在内存中连续存放
//	return 0;
//}




//int main()
//{
//	//二维数组的创建和初始化
//	//1 2 3 4
//	//1 2 3 4
//	//1 2 3 4
//	//int arr1[3][4];//前行后列
//	//int arr[3][4] = { {1,2,3,4},{2,3,4},{5,3,4}};
//	//int arr1[][4] = { {1,2,3,4},{2,3}};//4行(由{1,2,3,4}决定)4列
//
//	//二维数组的使用
//	//int arr1[][3]={{1,2,3},2,3,4,3,4,5};
//	//printf("%d ",arr1[1]);
//	//printf("%d ",arr1[0][2]);
//	/*int i = 0;
//	int j = 0;
//	for(i=0;i<3;i++)
//	{
//		for(j=0;j<3;j++)
//			printf("%d ", arr1[i][j]);
//		printf("%d\n", arr1[i][j]);
//	}*/
//	
//	//二维数组看作一维数组？
//	//可		二维数组一行--->一维数组的一个元素
//
//
//
//	//二维数组在内存的存储
//	int arr1[3][3]={{1,2,3},2,3,4,3,4,5};//相当于arr[9],只不过访问方式不一样
//	int i = 0;
//	int j = 0;
//	for(i=0;i<3;i++)
//	{
//		for(j=0;j<3;j++)
//			printf("arr[%d][%d]=%p\n",i,j,&arr1[i][j]);//依旧连续存放(1,2,3,2,3,4,3,4,5)
//	}
//	return 0;
//}



//数组越界
//arr[n],共有n个元素，访问下标-x/x>n-1,这时数组越界
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6 };
//	printf("%d", arr[9]);
//
//	return 0;
//}


//冒泡排序（归并、快速、选择）
//9 8 7 6 5 4 3 2 1.....---->8 7 6 5 4 3 2 1 9......----->1 2 3 4 5 6 7 8 9


////数组传参，形参有两种形式
////1.指针：
////2.数组：
//void bubble(int arr[],int sz)
//{
//	//趟数i
//	int i = 0;
//	for(i=0;i<sz-1;i++)
//	{
//		//一趟冒泡排序j
//		int j = 0;
//		for (j=0;j<sz-1-i;j++)
//		{
//			if (arr[j] > arr[j + 1])
//			{
//				//交换
//				int m = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = m;
//			}
//		}
//	}
//}
//
//int main()
//{
//	int arr[] = { 9,8,7,6,5,4,3,2,1 };
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//冒泡排序
//	bubble(arr,sz);
//	int i = 0;
//	for (i = 0;i < sz;i++)
//	{
//		printf("%d ",arr[i]);
//	}
//	return 0;
//}



