#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<limits.h>

////浮点型在内存中的存储
// 浮点数包括：float、double、long double
// float、double表示的范围：float.h中定义
// 
//int main()
//{
//	int n = 9;
//	//0000 0000 0000 0000 0000 0000 0000 1001
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0? - 0.000000 (int存放 -> float拿出)
//	//0 00000000 00000000000000000001001
//	//s=0,m=0.00000000000000000010001,e=2^(-126)
//	*pFloat = 9.0;
//	//1001.0
//	// (-1)^0*1.001*2^3
//	// s=0,e=3,m=1.001
//	//0 10000010 00100000000000000000000 
//	printf("num的值为：%d\n", n);//9? - 1091567616 (float存放 -> int拿出)
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0
//
//	return 0;
//}
//
//浮点数存储规则(IEEE754标准)
// 任何一个二进制浮点数V，可写成下面的形式：
// (-1)^S*M*2^E
// (-1)^S表示符号位，当S=0,V为正数;当S=1，V为负数
// M表示有效数字(1 <= M < 2)
// M=1.XXXXXXXX...
// 只保存XXXXXXXX部分，读取时自动加1(节省一位bit位)
// 2^E表示指数位
// E - unsigned int(8bit - 0~255	11bit - 0~2047)
// E加上中间值(8bit - 127	11bit - 1023)
// 0.5 -> (-1)^1*1.0*2^(-1)(S=1,M=1.0,E=-1)
// float:E=(真实值+中间值) -> (-1)+127=126
// double:E=1023+(-1) ->1022
// 
// 5.0 -> (-1)^0*1.01*2^2(S=0,M=1.01,E=2)
// 9.5 -> (-1)^0*1.0011*2^3(S=0,M=1.0011,E=3)
// 9.6 -> (-1)^0*1.00110011...*2^3(S=0,M=1.00110011...,E=3)  精度丢失，无法精确保存
// 对于float类型(32bits)的数据:S - 1bit,E - 8bit,M - 23bit
// 对于double类型(64bits)的数据：S - 1,E - 11,M - 52
//
//指数E从内存中取出(3')
//1、E不全为0/不为全1
//	 E-中间值+1 -> 真实值
//2、E全为0
//	 E=1-中间值 -> 真实值
//3、E全为1
//	 E -> +-无穷大的数字(2^128)
