#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>

//操作符
 
 
 
//1、算数操作符：+ - * / %
//==>1/2=0;
//==>1/2.0=0.5;
//==>1.0/2=0.5;
//==>1.0/2.0=0.5;

//7%2=1
//7%2.0=...(不可行)
//负数取模？(B站：蛋哥---C语言深度解剖)



//2、移位操作符(移动的是二进制位)
//    <<:左移操作符(左移有乘2的效果)    >>:右移操作符(右移有除2的效果)   [正负整数一样，浮点型不能用]
//	  *不能移动负数位 浮点位，这个标准未定义
//二进制：0`1
//八进制：0`7
//十进制：0`9
//十六进制：0`9  a`f(或A`F)[即10`15]
// 
// 整数的二进制表示(3种)
// 源码：
// 反码：
// 补码：
// 
// 正的整数的  源码、反码、补码  相同
// 负的整数的  源码、反码、补码  是要计算的
// 
// 7(最高位为0，说明为正数)
// 7的源码=反码=补码：00000000000000000000000000000111(int-4字节，32bit)
// 
// -7(最高位为1，说明为负数)
// 源码：10000000000000000000000000000111
// 反码：11111111111111111111111111111000(符号位不变，其他位 按位取反)
// 补码：11111111111111111111111111111001(依照反码 其他位不变，最后一位+1)
// 
// 整数在内存中存储的是ta的补码
// 位移操作符移动的是内存中补码的二进制序列
// 
// 
//   <<:左移操作符(左边丢弃，右边补0)
//int main()
//{
//	int a = 7;//00000000000000000000000000000111---->00000000000000000000000000001110
//	int b = a << 1;//a向左移动一位
//	printf("a=%d\n", a);//注意奥，a本身是不变的
//	printf("b=%d\n", b);
//	return 0;
//}
//
//int main()
//{
//	int a = -7;//11111111111111111111111111111001
//	int b = a << 1;//a向左移动一位：--->11111111111111111111111111110010(补码)--->11111111111111111111111111110001(反码)--->10000000000000000000000000001110(源码)===>-14
//	printf("a=%d\n", a);//注意奥，a本身是不变的
//	printf("b=%d\n", b);
//	return 0;
//}
//
//
//右移操作符：
//1、算数移位(负-->负)：右边丢弃，左边补原符号位(正数补0，负数补1)
//2、逻辑移位(负-->正)：右边丢弃，左边补0
//int main()
//{
//	//int a = 7;//a=00000000000000000000000000000111
//	//int b = a >> 1;//b=00000000000000000000000000000011==>b=3
//	//printf("a=%d", a);
//	//printf("b=%d", b);
//	int a = -7;//a=11111111111111111111111111111001
//	int b = a >> 1;//如果是 算数移位b=11111111111111111111111111111100==>负数b=-4,如果是 逻辑移位b=01111111111111111111111111111100==>正数
//	printf("a=%d\n", a);
//	printf("b=%d\n", b);//显然，VS编译器采用了算数右移(一般编译器都是算数右移)
//
//	return 0;
//}



//3、位操作符(只适用于整数，浮点数用不了)

//	&：按(二进制)位与
//int main()
//{
//	int a = 3;//00000000000000000000000000000011(补码)
//	int b = -5;//11111111111111111111111111111011(补码)
//				//&(都为1==>1,只要有一个为0==>0)
//	int c = a & b;// ==>00000000000000000000000000000011==>3
//	printf("c=%d", c);
//
//	return  0;
//}

//	|：按(二进制)位或
//int main()
//{
//	int a = 3;//00000000000000000000000000000011(补码)
//	int b = -5;//11111111111111111111111111111011(补码)
//	//|(都为0==>0,只要有一个为1==>1)
//	int c = a | b;// ==>11111111111111111111111111111011==>-5
//	printf("c=%d", c);
//
//	return  0;
//}

//	^：按(二进制)位异或
//int main()
//{
//	int a = 3;//00000000000000000000000000000011(补码)
//	int b = -5;//11111111111111111111111111111011(补码)
//	//|(相同为0，相异为1)
//	int c = a ^ b;// ==>11111111111111111111111111111000==>-8
//	printf("c=%d", c);
//
//	return  0;
//}
//3^3=0->a^a=0
//0^5=5->0^a=a
//3^5^3=5  --->  3^3^5  --->  0^5=5
//即：异或操作符支持交换律
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前：a=%d,b=%d\n", a, b);
//
//	//a = a + b;//但可能溢出，理论上不够普适
//	//b = a - b;
//	//a = a - b;
//
//	a = a ^ b;
//	b = a ^ b;//(3^5)^5--->3
//	a = a ^ b;//(3^5)^3--->5
//	printf("交换后：a=%d,b=%d\n", a, b);
//
//	return 0;
//}



//4、赋值操作符
// 
//int main()
//{
//	int a = 3;//这叫初始化
//	a = 4l;//这叫赋值
//	return 0;
//}
//
//复合操作符
//	+=
//	-=
//	*=
//	/=
//	%=
//	>>=
//	<<=
//	&=
//	|=
//	^=



//5、单目操作符
//！		逻辑反操作
//int main()
//{
//	int flag = 3;
//	if(flag)//flag为真，进入if
//	{ }
//	if(!flag)//flag为假，进入if
//	{ }
//	return 0;
//}
// -		负值（a = -10）
// +		正值（a = +10）
// &		取地址  int a=10;	printf("%p",&a);	int* p=&a;(int占四个字节，四个字节中的首字节)
// sizeof	计算的是变量(类型、数组……)所占内存空间的大小（单位：字节）

// ~		对一个数的二进制按(二进制所有位，包括符号位)位取反
//int main()
//{
//	int a = 0;
//	//00000000000000000000000000000000 - 补码
//	//11111111111111111111111111111111 -> ~a
//	//11111111111111111111111111111110
//	//10000000000000000000000000000001 -> -1
//	printf("%d", ~a);
//	return 0;
//}

// --		前置、后置(前置，先++，后用)(后置，先用，后++)
// ++		前置、后置

//*			间接访问操作符(解引用操作符)//配合指针一起使用
//int main()
//{
//	int a = 10;
//	int* p = &a;	//C++中引用
//	printf("%d\n", a);
//	printf("%p\n", p);
//
//	
//	return 0;
//}

//()强制类型转换
//sizeof是操作符，不是函数
//strlen是库函数，只适用于字符串求长度



//6、关系操作符
//	>
//	>=
//	<
//	<=
//	!=
//	==(区别于"=")
//两个字符串比较应该使用"strcmp"



//7、逻辑操作符
//	&&：逻辑与(左边为假，则右边不计算)
//	||：逻辑或(右边为真，则右边不计算)



//8、条件操作符(三目操作符)
//  ?(1);(0)
//不要写的过于复杂，少嵌套

//int main()
//{
//	int a = 0;
//	int b = 0;
//
//	//(a > 5) ? (b = 3) : (b = -3);//一定要加()
//	//b = (a > 5 ? 3 : -3);
//
//	int max = 0;
//	scanf("%d%d", &a, &b);
//	max = (a >= b ? a : b);
//	printf("%d\n", max);
//
//	return 0;
//}



//9、逗号表达式(从左到右以此计算，取最后一个值)
//int get_val()
//{ }
//int count_val(int x)
//{ }
//int main()
//{
//	int a = 0;
//	a = get_val();
//	count_val(a);
//	while (a > 0)
//	{ }
//	//===>
//	while(a = get_val(), count_val(a), a > 0)
//	{ }
//
//	return 0;
//}